soap-test-income/soap_anty_inc1-1.0.xml.txt

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" s:mustUnderstand="1">
      <wsse:UsernameToken wsu:Id="UsernameToken-1">
        <wsse:Username>CUST01</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">tpMJTdMtapPfkGMoNT0b9JH5FRU=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">p8ChbCgLSeXtgvylGkzaKA==</wsse:Nonce>
        <wsu:Created>2023-04-27T11:00:55.482Z</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </s:Header>
  <s:Body>
    <cws:anty_income_request1 xmlns="http://www.cannex.com" xmlns:cws="http://www.cannex.com/ws" version="1.0">
      <income_request1_set>
        <logon_id>CUST01</logon_id>
        <user_id/>
        <transaction_id>37a161cc-de65-4ee0-a88f-8c6bcfde0a01</transaction_id>
        <income_request_data>
          <state_cd>AL</state_cd>
          <contract_cd>S</contract_cd>
          <premium>100.0</premium>
          <purchase_date>2023-04-27</purchase_date>
          <gender_cd_primary>M</gender_cd_primary>
          <purchase_age_primary>50</purchase_age_primary>
          <income_start_age_primary>55</income_start_age_primary>
        </income_request_data>
        <anty_ds_version_id>A4VF3H</anty_ds_version_id>
        <analysis_data_id>0017960796</analysis_data_id>
        <analysis_data_id>0017972448</analysis_data_id>
        <analysis_data_id>0017972449</analysis_data_id>
        <analysis_data_id>0018068691</analysis_data_id>
        <analysis_data_id>0018068692</analysis_data_id>
        <analysis_data_id>0018068693</analysis_data_id>
        <analysis_data_id>0018068745</analysis_data_id>
        <analysis_data_id>0018068746</analysis_data_id>
        <analysis_data_id>0018068747</analysis_data_id>
        <analysis_data_id>0018068748</analysis_data_id>
        <analysis_data_id>0018068749</analysis_data_id>
        <analysis_data_id>0018135729</analysis_data_id>
        <cnx_sequence_id>0</cnx_sequence_id>
        <cnx_sequence_id>1</cnx_sequence_id>
        <is_test>N</is_test>
      </income_request1_set>
    </cws:anty_income_request1>
  </s:Body>
</s:Envelope>

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ns2:anty_income_response1 xmlns="http://www.cannex.com" xmlns:ns2="http://www.cannex.com/ws">
      <income_response1>
        <income_datetime>2023-04-27T07:00:56.401-04:00</income_datetime>
        <transaction_id>37a161cc-de65-4ee0-a88f-8c6bcfde0a01</transaction_id>
        <income_request_data>
          <state_cd>AL</state_cd>
          <contract_cd>S</contract_cd>
          <premium>100.0</premium>
          <purchase_date>2023-04-27</purchase_date>
          <gender_cd_primary>M</gender_cd_primary>
          <purchase_age_primary>50</purchase_age_primary>
          <income_start_age_primary>55</income_start_age_primary>
        </income_request_data>
        <anty_ds_version_id>A4VF3H</anty_ds_version_id>
        <income_request_id>E134B11C</income_request_id>
      </income_response1>
    </ns2:anty_income_response1>
  </s:Body>
</s:Envelope>

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" s:mustUnderstand="1">
      <wsse:UsernameToken wsu:Id="UsernameToken-2">
        <wsse:Username>CUST01</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">8fqrcWZlfxkgjaMAvr3N2DzepBQ=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">HJ6luueuegRLTNB/+f/ueA==</wsse:Nonce>
        <wsu:Created>2023-04-27T11:00:56.700Z</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </s:Header>
  <s:Body>
    <cws:anty_income_request1 xmlns="http://www.cannex.com" xmlns:cws="http://www.cannex.com/ws" version="1.0">
      <income_request1>
        <logon_id>CUST01</logon_id>
        <user_id/>
        <transaction_id>37a161cc-de65-4ee0-a88f-8c6bcfde0a01</transaction_id>
        <income_request_id>E134B11C</income_request_id>
        <is_test>N</is_test>
      </income_request1>
    </cws:anty_income_request1>
  </s:Body>
</s:Envelope>

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ns2:anty_income_response1 xmlns="http://www.cannex.com" xmlns:ns2="http://www.cannex.com/ws">
      <income_response1_set>
        <income_datetime>2023-04-27T07:00:57.216-04:00</income_datetime>
        <transaction_id>37a161cc-de65-4ee0-a88f-8c6bcfde0a01</transaction_id>
        <income_request_data>
          <state_cd>AL</state_cd>
          <contract_cd>S</contract_cd>
          <premium>100.0</premium>
          <purchase_date>2023-04-27</purchase_date>
          <gender_cd_primary>M</gender_cd_primary>
          <purchase_age_primary>50</purchase_age_primary>
          <income_start_age_primary>55</income_start_age_primary>
        </income_request_data>
        <anty_ds_version_id>A4VF3H</anty_ds_version_id>
        <status_cd>P</status_cd>
      </income_response1_set>
    </ns2:anty_income_response1>
  </s:Body>
</s:Envelope>

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" s:mustUnderstand="1">
      <wsse:UsernameToken wsu:Id="UsernameToken-9">
        <wsse:Username>CUST01</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">hAOl2EaOx8ofwBAtmlQbz3fgilE=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">tptQTE4pAxy6VhxEgE8BEw==</wsse:Nonce>
        <wsu:Created>2023-04-27T11:01:23.878Z</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </s:Header>
  <s:Body>
    <cws:anty_income_request1 xmlns="http://www.cannex.com" xmlns:cws="http://www.cannex.com/ws" version="1.0">
      <income_request1>
        <logon_id>CUST01</logon_id>
        <user_id/>
        <transaction_id>37a161cc-de65-4ee0-a88f-8c6bcfde0a01</transaction_id>
        <income_request_id>E134B11C</income_request_id>
        <is_test>N</is_test>
      </income_request1>
    </cws:anty_income_request1>
  </s:Body>
</s:Envelope>

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ns2:anty_income_response1 xmlns="http://www.cannex.com" xmlns:ns2="http://www.cannex.com/ws">
      <income_response1_set>
        <income_datetime>2023-04-27T07:01:22.295-04:00</income_datetime>
        <transaction_id>37a161cc-de65-4ee0-a88f-8c6bcfde0a01</transaction_id>
        <income_request_data>
          <state_cd>AL</state_cd>
          <contract_cd>S</contract_cd>
          <premium>100.0</premium>
          <purchase_date>2023-04-27</purchase_date>
          <gender_cd_primary>M</gender_cd_primary>
          <purchase_age_primary>50</purchase_age_primary>
          <income_start_age_primary>55</income_start_age_primary>
        </income_request_data>
        <anty_ds_version_id>A4VF3H</anty_ds_version_id>
        <income_request_id>E134B11C</income_request_id>
        <income_response_data>
          <analysis_data_id>0017960796</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_error>
            <error_cd>ANTY-WS01 1056</error_cd>
            <error_message>Analysis code cannot be used with fixed products.</error_message>
          </income_error>
        </income_response_data>
        <income_response_data>
          <analysis_data_id>0017960796</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_error>
            <error_cd>ANTY-WS01 1056</error_cd>
            <error_message>Analysis code cannot be used with fixed products.</error_message>
          </income_error>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3I</request_no>
          <analysis_data_id>0017972448</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>8.25</initial_income>
            <highest_income>8.25</highest_income>
            <lowest_income>8.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3J</request_no>
          <analysis_data_id>0017972448</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>10.67</initial_income>
            <highest_income>35.52</highest_income>
            <lowest_income>10.67</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3K</request_no>
          <analysis_data_id>0017972449</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>8.25</initial_income>
            <highest_income>8.25</highest_income>
            <lowest_income>8.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3L</request_no>
          <analysis_data_id>0017972449</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>45.45</initial_income>
            <highest_income>144610.2</highest_income>
            <lowest_income>45.45</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3M</request_no>
          <analysis_data_id>0018068691</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>10.77</initial_income>
            <highest_income>10.77</highest_income>
            <lowest_income>10.77</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3N</request_no>
          <analysis_data_id>0018068691</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>10.77</initial_income>
            <highest_income>10.77</highest_income>
            <lowest_income>10.77</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3O</request_no>
          <analysis_data_id>0018068692</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>10.77</initial_income>
            <highest_income>10.77</highest_income>
            <lowest_income>10.77</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3P</request_no>
          <analysis_data_id>0018068692</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>31.28</initial_income>
            <highest_income>598.07</highest_income>
            <lowest_income>31.28</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3Q</request_no>
          <analysis_data_id>0018068693</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>10.77</initial_income>
            <highest_income>10.77</highest_income>
            <lowest_income>10.77</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3R</request_no>
          <analysis_data_id>0018068693</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>10.77</initial_income>
            <highest_income>10.77</highest_income>
            <lowest_income>10.77</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3S</request_no>
          <analysis_data_id>0018068745</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>11.25</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3T</request_no>
          <analysis_data_id>0018068745</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>11.25</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3U</request_no>
          <analysis_data_id>0018068746</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>11.25</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3V</request_no>
          <analysis_data_id>0018068746</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>1301.82</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3W</request_no>
          <analysis_data_id>0018068747</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>11.25</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3X</request_no>
          <analysis_data_id>0018068747</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>26.18</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3Y</request_no>
          <analysis_data_id>0018068748</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>11.25</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF3Z</request_no>
          <analysis_data_id>0018068748</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>11.25</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF40</request_no>
          <analysis_data_id>0018068749</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>11.25</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF41</request_no>
          <analysis_data_id>0018068749</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>11.25</initial_income>
            <highest_income>11.25</highest_income>
            <lowest_income>11.25</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF42</request_no>
          <analysis_data_id>0018135729</analysis_data_id>
          <cnx_sequence_id>0</cnx_sequence_id>
          <income_data>
            <initial_income>9.9</initial_income>
            <highest_income>9.9</highest_income>
            <lowest_income>9.9</lowest_income>
          </income_data>
        </income_response_data>
        <income_response_data>
          <request_no>A4VF43</request_no>
          <analysis_data_id>0018135729</analysis_data_id>
          <cnx_sequence_id>1</cnx_sequence_id>
          <income_data>
            <initial_income>12.79</initial_income>
            <highest_income>12.79</highest_income>
            <lowest_income>12.79</lowest_income>
          </income_data>
        </income_response_data>
        <status_cd>C</status_cd>
      </income_response1_set>
    </ns2:anty_income_response1>
  </s:Body>
</s:Envelope>
